; domain
(define (domain logistics)
	(:requirements :typing)
(:types
	apn1 - airplane
	airplane location vehicle package city truck - object
	tru1 tru2 - truck
	airport - location
	truck airplane - vehicle
)
(:predicates
	(at ?obj - object ?loc - location)
	(in ?obj1 - package ?veh - vehicle)
	(in-city ?loc - location ?city - city)
)

(:action load-airplane-apn1
	:parameters (?airplane - apn1 ?obj - package ?loc - airport)
	:precondition (and
		(at ?obj ?loc)
		(at ?airplane ?loc)
	)
	:effect (and
		(not (at ?obj ?loc))
		(in ?obj ?airplane)
	)
)


(:action unload-airplane-apn1
	:parameters (?airplane - apn1 ?obj - package ?loc - airport)
	:precondition (and
		(in ?obj ?airplane)
		(at ?airplane ?loc)
	)
	:effect (and
		(not (in ?obj ?airplane))
		(at ?obj ?loc)
	)
)


(:action fly-airplane-apn1
	:parameters (?airplane - apn1 ?loc-from - airport ?loc-to - airport)
	:precondition 
		(at ?airplane ?loc-from)
	:effect (and
		(not (at ?airplane ?loc-from))
		(at ?airplane ?loc-to)
	)
)


(:action load-truck-tru1
	:parameters (?truck - tru1 ?obj - package ?loc - location)
	:precondition (and
		(at ?truck ?loc)
		(at ?obj ?loc)
	)
	:effect (and
		(not (at ?obj ?loc))
		(in ?obj ?truck)
	)
)


(:action unload-truck-tru1
	:parameters (?truck - tru1 ?obj - package ?loc - location)
	:precondition (and
		(at ?truck ?loc)
		(in ?obj ?truck)
	)
	:effect (and
		(not (in ?obj ?truck))
		(at ?obj ?loc)
	)
)


(:action drive-truck-tru1
	:parameters (?truck - tru1 ?loc-from - location ?loc-to - location ?city - city)
	:precondition (and
		(at ?truck ?loc-from)
		(in-city ?loc-from ?city)
		(in-city ?loc-to ?city)
	)
	:effect (and
		(not (at ?truck ?loc-from))
		(at ?truck ?loc-to)
	)
)


(:action load-truck-tru2
	:parameters (?truck - tru2 ?obj - package ?loc - location)
	:precondition (and
		(at ?truck ?loc)
		(at ?obj ?loc)
	)
	:effect (and
		(not (at ?obj ?loc))
		(in ?obj ?truck)
	)
)


(:action unload-truck-tru2
	:parameters (?truck - tru2 ?obj - package ?loc - location)
	:precondition (and
		(at ?truck ?loc)
		(in ?obj ?truck)
	)
	:effect (and
		(not (in ?obj ?truck))
		(at ?obj ?loc)
	)
)


(:action drive-truck-tru2
	:parameters (?truck - tru2 ?loc-from - location ?loc-to - location ?city - city)
	:precondition (and
		(at ?truck ?loc-from)
		(in-city ?loc-from ?city)
		(in-city ?loc-to ?city)
	)
	:effect (and
		(not (at ?truck ?loc-from))
		(at ?truck ?loc-to)
	)
)

)

; problem
(define (problem probLOGISTICS-4-0_78) (:domain logistics)
(:objects
	cit2 - city
	cit1 - city
	obj11 - package
	tru1 - tru1
	apn1 - apn1
	apt2 - airport
	apt1 - airport
	pos1 - location
)
(:init
	(at apn1 apt2)
	(at tru1 pos1)
	(at obj11 pos1)
	(in-city pos1 cit1)
	(in-city apt1 cit1)
	(in-city apt2 cit2)
)
(:goal
	(and
		(at obj11 apt1)
		(at apn1 apt1)
		(at tru1 apt1)
	)
)
)

; plan
1. (load-truck-tru1 tru1 obj11 pos1)
   deleted: (at obj11 pos1)
   added: (in obj11 tru1)
   goals met: 0 of 3
2. (drive-truck-tru1 tru1 pos1 apt1 cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 apt1)
   goals met: 1 of 3
3. (unload-truck-tru1 tru1 obj11 apt1)
   deleted: (in obj11 tru1)
   added: (at obj11 apt1)
   goals met: 2 of 3
4. (fly-airplane-apn1 apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 3 of 3
